[
  "Aim trainers are independent video games, software that is secondary to real FPS games, designed for the purpose of helping FPS game players improve at their raw aiming mechanics, namely mouse control. Mouse control is the universal foundation for all aiming within FPS Esports.",
  "You can always aim train for fun, but most people start aim training because they want to elevate their skills in first-person and third-person shooter games. Let’s start with the benefits of aim training.",
  "Aim training can help you more consistently hit shots in-game, they can enable you to find more opportunities to outplay your opponents, they can help you read target movements better, and they may give you better overall control over your mouse, even in non-aiming situations.",
  "While helpful, aim trainers are NEVER a substitute for in-game practice, and if your main priority is improving at your main esport, you should only treat aim trainers as supplemental. This will affect what you practice, as well as how long you practice for.",
  "Probably the most effective split for in-game practice and aim trainer practice is 70-30 respectively, where you spend 70% of your time playing the main game, and 30% of your time playing only the most relevant scenarios within the aim trainer. There are some things the aim trainer cannot do.",
  "The aim trainer will not help you have better positioning in game or stronger game sense that would influence decision-making skills. Essentially, aim training will NOT help you to improve at anything that can be considered a part of game-specific knowledge or mechanics that are not aim-related.",
  "What is the motivation behind playing the aim trainer at all? It is about maximizing opportunities. Over ordinary in-game practice, aim training has four key advantages: isolation, repetition, customization, and feedback.",
  "Namely, this is isolation in practicing a specific skill without any distractions, repeating the same practice over and over quickly, with numerous, highly customizable scenarios, giving you instantaneous feedback on your progress.",
  "When choosing an aim trainer, you should go with Kovaak’s FPS Aim Trainer, which can be installed on Steam for 10 dollars. If you want a free aim trainer instead, go with Aimlabs. Aimbeast is another paid alternative.",
  "Kovaak’s has the best scenario variety and the most scenarios to choose from, Aimlabs is often used for competitions and benchmarking, and Aimbeast is mostly for very high level players.",
  "Do not hesitate to start aim training out of fear that your setup is not good enough. However, there are ways to upgrade your setup, such that your experience with the aim trainer and improvement progress might be elevated.",
  "Get at least a 144hz monitor, ideally 240hz. Get a modern gaming mouse with a good sensor and a low maintenance mousepad with a speed appropriate for you. Upgrade your PC specs. Maybe experiment with mouse skates or a gaming sleeve.",
  "Even if you are discouraged about your setup and do not want to spend a fortune, keep in mind that some very top level aimers have achieved great things on 60hz monitors. Specifically, players like eloevv and Mana."
]